
# -*- coding: utf-8 -*-
"""
_PIN_ 🦀 
@author: henry # 
"""
import os
import django
import sys
import logging
logger = logging.getLogger(__name__)


# CurrentWorkDirectory = os.getcwd()
# sys.path.append(CurrentWorkDirectory)

os.environ.setdefault('DJANGO_SETTINGS_MODULE', 'config.settings.local')
os.environ["DJANGO_ALLOW_ASYNC_UNSAFE"] = "true" #WARN Disable when not working with spyder

# Now set up Django
django.setup()

print(django.get_version())
# logger.info(django.get_version())


# ═══════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
# ×●●●× ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ║                                                                                                  ║
# ═══════════════════════════════════════════════════════════════════════════════════════════════════════════════╝


import requests
import json
from pprint import pprint # Para imprimir o JSON de forma bonita

params = {
    'year': 2023,
    'area': 'salvador',
    'variable': 'valor_da_producao',
    'type': 'municipio'
}

response = requests.get('http://127.0.0.1:8000/api/v1/getTopValues/', params=params)

# Verificando o status e imprimindo o conteúdo
if response.status_code == 200:
    print("Resposta recebida com sucesso:")
    print(response.json())  # Se a resposta for JSON
else:
    print("Deu ruim")



# ═══════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
# ×●●●× ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ║                                                                                                  ║
# ═══════════════════════════════════════════════════════════════════════════════════════════════════════════════╝

import requests
import json

nome_do_arquivo = 'BahiaCidades4.json'

try:
    with open(nome_do_arquivo, 'r', encoding='utf-8') as arquivo:
        dados = json.load(arquivo)

except FileNotFoundError:
    print(f"Erro: O arquivo '{nome_do_arquivo}' não foi encontrado no diretório.")
    exit() 
except json.JSONDecodeError:
    print(f"Erro: O arquivo '{nome_do_arquivo}' não contém um JSON válido.")
    exit() 

lista_de_ids = []

for lista_de_cidades in dados.values():
    for cidade in lista_de_cidades:
        lista_de_ids.append(cidade['id'])



# ═══════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
# ×●●●× ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ║                                                                                                  ║
# ═══════════════════════════════════════════════════════════════════════════════════════════════════════════════╝



result = []

for teste_id in lista_de_ids:

    params = {
        'year': 2023,
        'area': teste_id,
        'variable': 'valor_da_producao',
        'type': 'municipio'
    }
    
    response = requests.get('http://127.0.0.1:8000/api/v1/getTopValues/', params=params)
    result.append((teste_id,response.status_code))



# ═══════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
# ×●●●× ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ●●●● ○○○○ ║                                                                                                  ║
# ═══════════════════════════════════════════════════════════════════════════════════════════════════════════════╝


putos = [id for id in result if id[1] != 200]










